Revit 2027 API
RebarShapeDefinitionBySegments.GetVertex Method
 Return a reference to one of the vertices in the definition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeVertex GetVertex(
	int vertexIndex
)
Public Function GetVertex (
	vertexIndex As Integer
) As RebarShapeVertex
public:
RebarShapeVertex^ GetVertex(
	int vertexIndex
)
member GetVertex :
        vertexIndex : int -> RebarShapeVertex
Parameters
vertexIndex Int32
 Index of the vertex (0 to NumberOfVertices - 1).
Return Value
RebarShapeVertex
 The requested vertex.
Exceptions
Exception | Condition
ArgumentException |  vertexIndex is not between 0 and NumberOfVertices.
See Also
Reference
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace